'''Дан список:
['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 
 'градусов']

Необходимо его обработать — обособить каждое целое число (вещественные не 
трогаем) кавычками (добавить кавычку до и кавычку после элемента списка, 
являющегося числом) и дополнить нулём до двух целочисленных разрядов:
['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 
'воздуха', 'была', '"', '+05', '"', 'градусов']

Сформировать из обработанного списка строку:
в "05" часов "17" минут температура воздуха была "+05" градусов

Подумать, какое условие записать, чтобы выявить числа среди элементов списка? 
Как модифицировать это условие для чисел со знаком?
Примечание: если обособление чисел кавычками не будет получаться - можете 
вернуться к его реализации позже. Главное: дополнить числа до двух 
разрядов нулём!'''

words = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 
 'градусов']

words_new = []
message = ''
for word in words:
    if word[0] in ('+', '-'):
        word='"' + word.zfill(3) + '"' 
    if (word.isdigit()):
        word='"' + word.zfill(2) + '"'
    words_new.append(word)  
print(' '.join(words_new))